[{"Day": "Monday", "Title": "Grilled Veggie Quesadilla", "Ingredients": ["2 whole wheat tortillas", "1/2 cup sliced bell peppers", "1/2 cup sliced onions", "1/2 cup sliced zucchini", "1 cup shredded cheese (such as cheddar or Monterey Jack)", "1/4 cup salsa", "2 tbsp sour cream", "1/2 avocado, sliced"], "Instructions": ["Preheat a grill pan or skillet over medium heat.", "Add a small amount of oil and cook the bell peppers, onions, and zucchini until tender and slightly charred, about 5 minutes.", "Place one tortilla on the grill pan or skillet, sprinkle with half of the shredded cheese, and top with the grilled veggies.", "Sprinkle the remaining cheese on top and cover with the second tortilla.", "Cook for 2-3 minutes, or until the bottom tortilla is crispy and the cheese is melted.", " Carefully flip the quesadilla and cook for another 2-3 minutes."]}, {"Day": "Tuesday", "Title": "Caprese Pasta Salad", "Ingredients": ["1 cup whole grain pasta (such as rotini or penne)", "1 cup cherry tomatoes, halved", "1 cup fresh basil, torn", "1 cup fresh mozzarella, cubed", "2 tbsp olive oil", "2 tbsp balsamic vinegar", "Salt and pepper, to taste"], "Instructions": ["Cook the pasta according to package instructions.", " Drain and rinse under cold water to cool.", "In a large bowl, combine the cooked pasta, cherry tomatoes, basil, and mozzarella.", "In a small bowl, whisk together the olive oil, balsamic vinegar, salt, and pepper.", "Pour the dressing over the pasta salad and toss to combine.", " Adjust seasonings as needed and serve chilled."]}, {"Day": "Wednesday", "Title": "Veggie Fried Rice", "Ingredients": ["1 cup cooked brown rice", "1 cup mixed vegetables (carrots, peas, corn, and broccoli)", "1/4 cup chopped green onions", "2 tbsp soy sauce", "1 tsp sesame oil", "1 large egg, beaten"], "Instructions": ["In a large skillet or wok, heat a small amount of oil over medium heat.", "Add the mixed vegetables and cook until tender, about 3-4 minutes.", "Stir in the cooked brown rice and green onions, and cook for another 2-3 minutes.", "Push the rice mixture to one side of the skillet, and pour the beaten egg into the empty space.", "Scramble the egg until cooked, then mix it into the rice and vegetables.", "Stir in the soy sauce and sesame oil, and cook for another 1-2 minutes, until everything is heated through."]}, {"Day": "Thursday", "Title": "Chickpea Salad Wrap", "Ingredients": ["1 can chickpeas, drained and rinsed", "1/2 cup chopped cucumber", "1/2 cup chopped tomatoes", "1/4 cup diced red onion", "1 cup mixed greens", "1/4 cup crumbled feta cheese", "1 whole wheat wrap", "Juice of 1 lemon", "1 tbsp olive oil", "1 clove garlic, minced", "Salt and pepper, to taste"], "Instructions": ["In a large bowl, combine the chickpeas, cucumber, tomatoes, red onion, mixed greens, and feta cheese.", "In a small bowl, whisk together the lemon juice, olive oil, garlic, salt, and pepper.", "Pour the dressing over the salad and tossto combine.", "Lay the whole wheat wrap on a flat surface and spoon the chickpea salad mixture onto the center of the wrap.", "Fold in the sides of the wrap and then roll it up tightly, enclosing the filling.", "Cut the wrap in half and serve immediately or wrap it in foil and refrigerate for a quick grab-and-go meal."]}, {"Day": "Friday", "Title": "Margherita Pizza", "Ingredients": ["1 whole wheat pizza crust (store-bought or homemade)", "1/2 cup tomato sauce", "1 cup fresh mozzarella, sliced", "1/2 cup fresh basil leaves", "1 tbsp olive oil", "Salt and pepper, to taste"], "Instructions": ["Preheat your oven to 475°F (245°C) and place the pizza crust on a pizza stone or baking sheet.", "Spread the tomato sauce evenly over the pizza crust, leaving a small border around the edge.", "Arrange the sliced mozzarella evenly over the sauce and sprinkle with salt and pepper.", "Bake the pizza in the preheated oven for 10-12 minutes, or until the crust is golden and the cheese is bubbly.", "Remove the pizza from the oven and let it cool for a couple of minutes before topping with fresh basil leaves and a drizzle of olive oil.", " Slice and serve."]}, {"Day": "Saturday", "Title": "Vegetarian Nachos", "Ingredients": ["3 cups tortilla chips", "1 cup canned black beans, drained and rinsed", "1 1/2 cups shredded cheese (such as cheddar or Monterey Jack)", "1 jalapeno, sliced", "1/2 cup diced tomatoes", "1/2 avocado, diced", "1/4 cup sour cream", "1/4 cup chopped cilantro"], "Instructions": ["Preheat your oven to 350°F (175°C).", "Arrange the tortilla chips on a large baking sheet or oven-safe dish.", "Scatter the black beans, shredded cheese, and jalapeno slices evenly over the chips.", "Bake the nachos in the preheated oven for 8-10 minutes, or until the cheese is melted and bubbly.", "Remove the nachos from the oven and top with diced tomatoes, avocado, sour cream, and cilantro.", " Serve immediately."]}, {"Day": "Sunday", "Title": "Pesto Veggie Stir-fry", "Ingredients": ["1 cup whole grain pasta or noodles (such as spaghetti or fettuccine)", "1 cup cherry tomatoes, halved", "1 cup sliced bell peppers", "1 cup sliced zucchini", "2 cups baby spinach", "1/2 cup store-bought pesto sauce", "1/4 cup grated Parmesan cheese"], "Instructions": ["Cook the pasta or noodles according to package instructions.", " Drain and set aside.", "In a large skillet or wok, heat a small amount of oil over medium heat.", "Add the cherry tomatoes, bell peppers, and zucchini, and cook until tender, about 5 minutes.", "Stir in the baby spinach and cook until wilted, about 2 minutes.", "Add the cooked pasta or noodles to the skillet and mix in the pesto sauce, ensuring everything is well coated."]}]